{
    "eventData": [
      {
        "date": "09 DECEMBER 2024",
        "location": "BENGALURU",
        "events": [
          {
            "title": "TIE BANGALORE ANTARPRERANA LEADERSHIP SUMMIT 2024",
            "description": "A transformative gathering designed to empower entrepreneurs with insights drawn from both ancient wisdom and modern practices. This year’s summit emphasizes inner resilience and purposeful action, which are essential qualities for navigating the entrepreneurial journey. Explore discussions on topics such as Purpose Driven Leadership, Conscious Capitalism, NeuroScience of Entrepreneurship, The Inner Journey through Music, Holistic Wellbeing, etc. as insightful keynotes and fireside chats with renowned spiritual leaders and business icons. Explore startups in the meditation/ yoga/ holistic wellness space in a curated Start-up Pavilion.",
            "time": "09:00 AM - 05:00 PM",
            "location": "IISc, Bengaluru"
          },
          {
            "title": "LEARN, COLLABORATE, ACTION! MASTER CLASSES",
            "description": "Renowned Thought Leaders and Achievers deliver workshops on a variety of topics that can alter the course of any start-up. Key areas such as scaling, digital marketing, AI’s role in business, global expansion strategies, raising growth capital, and more. Opportunity to network with over 1000 leading entrepreneurs and opinion makers. Participants will get to choose from 9 different Master Classes. Each Master Class will be on a pre-registered basis, with limited seats. We will announce the Masterclasses schedule shortly.",
            "time": "09:00 AM - 05:00 PM",
            "location": "IISc, Bengaluru"
          },
          {
            "title": "TGS100 SEMI-FINALS",
            "description": "The most promising startups battle for a place in the finals of TiE's flagship global startup challenge to choose the Top 10 Finalists. All-day pitches to TiE Grand Jury.",
            "time": "09:00 AM - 05:00 PM",
            "location": "IISc, Bengaluru"
          },
          {
            "title": "TIE WOMEN SEMI-FINALS",
            "description": "Women entrepreneurs across the globe, winners from 61 chapters of TiE – irrespective of the size of the enterprises, origin, standing or background are competing. Top women-led startups compete for a spot in the finals of the global competition of the TiE Women initiative.",
            "time": "09:00 AM - 05:00 PM",
            "location": "IISc, Bengaluru"
          },
          {
            "title": "AURORA BENGALURIS! : WELCOME RECEPTION",
            "description": "Global Keynotes from iconic leaders and entertainment. Informal evening of drinks, dinner and engaging conversations. Opportunity to network with over 1000 leading entrepreneurs and opinion makers. Open only for VIP Access Pass Holder, Charter Members and Special Invitees.",
            "time": "06:30 PM - 10:00 PM",
            "location": "Chamara Vajra, Palace Grounds"
          }
        ]
      },
      {
        "date": "10 DECEMBER 2024",
        "location": "BANGALORE INTERNATIONAL EXHIBITION CENTER (BIEC)",
        "events": [
          {
            "title": "LET THE FIREWORKS BEGIN: THE OLYMPICS OF ENTREPRENEURSHIP INAUGURAL (MAINSTAGE)",
            "description": "A grand inauguration featuring delegations from TiE Chapters worldwide. Inspiring addresses & keynotes by national and international leaders, setting the tone for the Summit “Putting Entrepreneurship First”. Soak in the energy of 10,000+ attendees, comprising entrepreneurs, investors, innovators, industry leaders, policy makers, youth and academia.",
            "time": "09:00 AM - 12:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "FUTURESPARKS: LEADERS IN CONVERSATION (MAINSTAGE)",
            "description": "Riveting mainstage plenary sessions featuring renowned leaders sharing their perspectives on the shaping the future. Join globally-loved sporting icons and entertainment stars as they share insights into their own journeys as entrepreneurs and achievers. Get inspired and learn on how you can future proof your enterprise to succeed in an ever-evolving world. Deepdive into areas that will impact every business and entrepreneur - The Future of Money, The Future of Intelligence, The Future of Climate, and The Future of Talent.",
            "time": "12:00 PM - 06:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "FIREPOWHER: THE GLOBAL TIE WOMEN CONCLAVE (PARALLEL TRACK)",
            "description": "A parallel track of the Grand Finale of TiE Women Global Pitch Competition featuring 50+ finalists from over 3,000+ applicants worldwide. Global Keynotes and Thought Leaders discussing the landscape of opportunities and challenges and sharing their secret sauce for navigating it successfully. Meet powerful women entrepreneurs from our emerging towns and get inspired by their stories.",
            "time": "02:00 PM - 04:30 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "CXXO NOCEILING SUMMIT 2024 (PARALLEL TRACK)",
            "description": "Hosted by Kalaari Capital’s CXXO in partnership with AWS & Havas Media Network India. A platform for women of the Indian startup ecosystem to connect and forge impactful networks. Join over 400+ incredible women for this powerful program on the theme of “Audacity to Dream”.",
            "time": "04:30 PM - 06:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "INK SPACE @ TGS24: REDEFINING SUCCESS (PARALLEL TRACK)",
            "description": "With AI and innovation accelerating change exponentially, INK 2024 invites you to reimagine success in a way that balances progress and purpose. Hosted by INK, curation partners for TGS 2024. Join celebrities and changemakers in exclusive, behind-the-scenes conversations as they share personal journeys and perspectives on success. Participate in interactive sessions where you become a co-creator, helping shape and strategize on INK’s key projects as well as support the INK Fellows’ transformative work. Record your insights in fun, one-minute INK Drops to share your perspective offline and on social media, becoming part of a larger conversation on reimagining success. Open only for VIP Plus Access Pass Holder, Charter Members, and Special Invitees. This unconference is supported by Muthoot Blue, NextWealth, MAHE Bengaluru, Sparkl, Amita Rasa, Kosh, Discovery Village, SPI and other partners.",
            "time": "02:00 PM - 06:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "FIRESTARTERS GANG: THE TYECON (PARALLEL TRACK)",
            "description": "A dynamic track bringing together 500+ TiE Young Entrepreneurs and school innovation champions in the audience from metros, Tier-2, Tier-3 cities, and rural areas to collaborate, learn, and inspire each other. Inspiring keynotes by young entrepreneurs, motivation talks by experts and exciting pitches. By Invitation Only. Not open for all registered Participants",
            "time": "02:00 PM - 06:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "TIE UNICON CONCLAVE (PARALLEL TRACK)",
            "description": "A Conclave celebrating collegiate entrepreneurs at TiE Global Summit 2024. International students make a pitstop in Bangalore as part of an immersion program of TiE U – a comprehensive ecosystem that nurtures start-ups run by college/ university students. Young minds connect and pitch their ideas, and will receive guidance on transforming them into viable businesses. By Invitation Only. Not open for all registered Participants",
            "time": "02:00 PM - 06:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "LET THE SPARKS FLY: NETWORKING EVENING",
            "description": "Opportunity to network with other global attendees over some wonderful music and dance. Experience the best of Karnataka hospitality featuring a delectable array of specialty cuisine.",
            "time": "6.30 PM onwards",
            "location": "BIEC, Bengaluru"
          }
        ]
      },
      {
        "date": "11 DECEMBER 2024",
        "location": "BANGALORE INTERNATIONAL EXHIBITION CENTER (BIEC)",
        "events": [
          {
            "title": "FUTURE SHINING BRIGHT: FUTUREPRENEURS CONCLAVE (MAINSTAGE)",
            "description": "5000+ college students from across the world converge to shine the spotlight on our future. Join celebrated founders for keynote addresses and engaging discussions. Meet star founders who built pioneering startups and unicorns right out of college. Listen to young entrepreneurs driving massive societal change and get inspired.",
            "time": "09:00 AM - 01:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "\"WE DID START THE FIRE\": CONVERSATIONS WITH ICONIC ENTREPRENEURS, INVESTORS AND TRAILBLAZERS (MAINSTAGE)",
            "description": "Get set to be blown away by a powerhouse of global icons, pathbreaking entrepreneurs, investors and innovators talking about their learnings and perspectives on the future of opportunities and start-ups. A breezy set of conversations that is bound to inspire you and leave you spellbound.",
            "time": "02:00 PM - 05:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "EMERGING STARS: THE TGS100 SHOWCASE (PARALLEL TRACK)",
            "description": "TGS100 is our curation of the Top 100 early and seed stage startups worldwide. Listen to pitches by the Top 10 finalists to a super jury of global investor & entrepreneurs. Participate with over 1000+ attendees, comprising entrepreneurs, investors and industry leaders. Glean insights from the super jury conversations on their perspective of trends, opportunities and storytelling.",
            "time": "09:00 AM - 01:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "GLOBAL ENTREPRENEURIAL ECOSYSTEMS CONCLAVE (PARALLEL TRACK)",
            "description": "Hear from leaders from international start-up ecosystems, like Japan, Israel, Denmark, New Jersey, Germany and other regions on fostering innovation and open market access for startups. Collaborate and connect with representatives from trade organizations, Government entities, and private sector leaders for potential partnerships and knowledge-sharing opportunities. With examples like Unboxing Bangalore, KDEM Emerging Clusters, this forum will highlight how regional centers in India are creating pathways to global relevance through active engagement with local and international communities.",
            "time": "09:00 AM – 01:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "VENTURISE’24: ESDM BIG BANG (PARALLEL TRACK)",
            "description": "Supported by Department of Industries & Commerce, Government of Karnataka, this track will highlight the opportunities for entrepreneurs in the Electronics System Design and Manufacturing (ESDM) sector with plenary sessions with leading thought-leaders in the sector. Track dedicated to supporting innovative entrepreneurs who are driving the future of manufacturing and allied sectors with rich discussion on the nexus between corporates and startups to drive innovation.",
            "time": "09:00 AM – 01:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "AGRI ABUNDANCE BIG BANG (PARALLEL TRACK)",
            "description": "Discover trends and insights from experts on funding the next generation of agri-tech solutions and startups. Leaders in the sector will also delve into advancements in biotechnology that are driving breakthroughs in soil health, crop genetics, pest resistance, and overall agricultural productivity – creating opportunities for entrepreneurs. Explore how initiatives such as The Agri Collaboratory are making the Indian farmer profitable, sustainable, resilient by integrating ecosystem led Digital Public Rails, Open Data, Action Research and Policy Intervention.",
            "time": "09:00 AM – 01:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "DEMOCRATIZATION OF TECH BIG BANG (PARALLEL TRACK)",
            "description": "This track focuses on the significant of impact of Digital Public Infrastructure on Health, Education and Commerce sectors. Speakers and experts will engage in conversations around the Government infrastructure and advocacy programs, India’s leadership globally in tech democratization, changing approaches in tech entrepreneurship, and the role of tech accessibility beyond urban locations. Hear success stories and explore the possibilities of building with digital public infrastructure and tech stacks like ONDC and the Beckn Protocol.",
            "time": "09:00 AM – 01:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "GCC X START-UPS BIG BANG (PARALLEL TRACK)",
            "description": "This track will explore how GCCs (Global Capability Centres) are slowly and consistently contributing to innovation and entrepreneurship. The program will access the lay of the land in terms of current context, diversity of industries represented, segments and the journey of GCCs in India so far. Stories from the GCC ecosystem that have demonstrated high engagement with startups - investing, creating the market and opportunities for startups to thrive as well as programs/initiatives to identify and nurture startups.",
            "time": "09:00 AM – 01:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "THE FAMILY OFFICES CONCLAVE (PARALLEL TRACK)",
            "description": "An exclusive conclave, anchored by Chiratae Ventures and Entrust Family Office, to foster dialogue and knowledge-sharing among established and emerging family offices. High-profile keynotes and power-packed panels will explore actionable insights for family offices. Aiming to bring them together as peers, and enable growth and collaboration by taking steps such as creating shared value through co-investment opportunities. Open only to VIP+ ticket holders and special invitees. (By Invitation Only. Not open for all registered Participants)",
            "time": "02:00 PM – 05:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "EDVENTURES SUPER AI INNOVATION CONCLAVE (PARALLEL TRACK)",
            "description": "This session will anchor the crucial AI (Academia-Industry) discourse on how to nurture entrepreneurial education and skilling needs of the future that need to be anchored by higher education institutions, corporate institutions and startups. Key focus areas of discussions will be orchestrating the evolution of entrepreneurial education, building innovation ecosystems to support this, crafting the DNA for future ready institutions together and fostering student-led ventures and innovation labs. EdVentures will bring together catalysts like university Vice-Chancellors driving institutional change, global innovation experts, CHROs from dynamic start-ups redefining workplace requirements and education policymakers crafting supportive frameworks.",
            "time": "02:00 PM – 05:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "THE MSME CONCLAVE (PARALLEL TRACK)",
            "description": "Learn how MSMEs can embrace Industry 4.0 technologies to enhance productivity and competitiveness. Explore how India's MSMEs are driving the \"Make in Bharat\" movement, fueling growth and innovation across industries. Deepdive into the international opportunities available to Indian MSMEs looking to expand their manufacturing footprint.",
            "time": "02:00 PM – 05:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "VENTURISE’24 : AEROSPACE AND DEFENCE, EV AND CLEAN MOBILITY BIGBANG (PARALLEL TRACK)",
            "description": "Supported by Department of Industries & Commerce, Government of Karnataka, this track will continue from the morning session highlighting the other focus areas of Aerospace and Defence as well as EV and Clean Mobility. Track dedicated to these champion sectors which hold immense potential for startups, given the strong ecosystem support of both public and private players.",
            "time": "02:00 PM – 05:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "FINTECH BIG BANG (PARALLEL TRACK)",
            "description": "This deepdive track will take the attendees on a journey to look at Fintech from multiple lenses beyond Digital Payments. Indian and Global Speakers from banking and financial institutions, regulatory bodies, fintech startups will engage in a dialogue around Building Ecosystems of the Future, Technology Risks for Fintech, Technological Innovations in the Financial Sector, and more.",
            "time": "02:00 PM – 05:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "AI AND DEEPTECH BIGBANG (PARALLEL TRACK)",
            "description": "As AI drives a disruptive revolution in technology and entrepreneurship globally, this track examines what this holds for India, and also looks beyond AI at deeptech. Hear from experts and leading technologists as the reveal their playbooks on applying AI to solve India’s problems and the opportunity that holds for entrepreneurs across sectors. Learn to think big on how to do “Population-scale AI”, utilizing the opportunity to build with digital public infrastructure.",
            "time": "02:00 PM – 05:00 PM",
            "location": "BIEC, Bengaluru"
          },
          {
            "title": "INK SPACE @ TGS24: REDEFINING SUCCESS (PARALLEL TRACK)",
            "description": "With AI and innovation accelerating change exponentially, INK 2024 invites you to reimagine success in a way that balances progress and purpose. Hosted by INK, curation partners for TGS 2024. Join celebrities and changemakers in exclusive, behind-the-scenes conversations as they share personal journeys and perspectives on success. Participate in interactive sessions where you become a co-creator, helping shape and strategize on INK’s key projects as well as support the INK Fellows’ transformative work. Record your insights in fun, one-minute INK Drops to share your perspective offline and on social media, becoming part of a larger conversation on reimagining success. Open only for VIP Plus Access Pass Holder, Charter Members, and Special Invitees. This unconference is supported by Muthoot Blue, NextWealth, MAHE Bengaluru, Sparkl, Amita Rasa, Kosh, Discovery Village, SPI and other partners.",
            "time": "09:00 AM – 05:00 PM",
            "location": "BIEC, Bengaluru"
            },
            {
            "title": "INK SPACE @ TGS24: REDEFINING SUCCESS (PARALLEL TRACK)",
            "description": "With AI and innovation accelerating change exponentially, INK 2024 invites you to reimagine success in a way that balances progress and purpose. Hosted by INK, curation partners for TGS 2024. Join celebrities and changemakers in exclusive, behind-the-scenes conversations as they share personal journeys and perspectives on success. Participate in interactive sessions where you become a co-creator, helping shape and strategize on INK’s key projects as well as support the INK Fellows’ transformative work. Record your insights in fun, one-minute INK Drops to share your perspective offline and on social media, becoming part of a larger conversation on reimagining success. Open only for VIP Plus Access Pass Holder, Charter Members, and Special Invitees. This unconference is supported by Muthoot Blue, NextWealth, MAHE Bengaluru, Sparkl, Amita Rasa, Kosh, Discovery Village, SPI and other partners.",
            "time": "09:00 AM – 05:00 PM",
            "location": "BIEC, Bengaluru"
            }
            ]
     },
    {
        "date": "12 DECEMBER 2024",
        "location": "MYSURU",
        "events": [
            {
                "title": "CULTURE FLOWERPOWER @ INFOSYS MYSURU",
                "description": "TGS 2024 brings for the very first time, Cultural Entrepreneurship to the fore in partnership with NICE. The sessions will educate, inform and showcase branded cultural enterprises. The spotlight will also be on entrepreneurs, policy makers, funders, academics and industry leaders that are creating livelihoods, generating wealth and impacting Brand India in an eco-friendly manner. Sessions will include powerful talks and panels from notable cultural enterprises industries like tourism, jewelry, wellness, adventure among others. These conversations will range from exploring and celebrating the uniqueness of cultural entrepreneurship to discussing how to build thriving cultural entrepreneurship ecosystems. The program will also include inspiring talks by driven cultural entrepreneurs.",
                "time": "09:30 AM – 03:30 PM",
                "location": "Infosys, Mysuru"
            },
            {
                "title": "GLOBAL SUPERSTAR AWARDS: THE TIE GLOBAL AWARDS @ MYSURU PALACE",
                "description": "TiE Global Awards recognizes exemplary global entrepreneurs across 10+ categories. The Awardees will be shortlisted by a stellar jury and will be presented at a glittering ceremony in Mysore by our national leaders. Open only to VIP+ ticket holders and special invitees.",
                "time": "04:30 PM - 06:00 PM",
                "location": "Mysuru Palace"
            },
            {
                "title": "THE CITY OF LIGHTS: CLOSING RECEPTION",
                "description": "An exclusive evening amidst royal settings in Royal City of Mysuru. Sparkling conversations, active collaborations and blossoming friendships over sumptuous dinner & entertainment. Open only to VIP+ ticket holders and special invitees.",
                "time": "07:00 PM onwards",
                "location": "Mysuru"
            }
        ]
    }
    ]
}


          
